RT-Thread/rt-thread/bsp/nxp/lpc/lpc55sxx/Libraries/LPC55S06/LPC55S06/drivers/fsl_power.c
                    /*
                     * Prioritise Reset causes, starting from the strongest (Power On Reset)
                     */
                    if (0UL != (reset_cause_reg & PMC_AOREG1_POR_MASK))
                    { /* Power On Reset */
                        *p_reset_cause = kRESET_CAUSE_POR;
                    }
                    else
                    {
                        if (0UL != (reset_cause_reg & PMC_AOREG1_BODRESET_MASK))
                        { /* Brown-out Detector reset (either BODVBAT or BODCORE) */
                            *p_reset_cause = kRESET_CAUSE_BODRESET;
                        }
                        else
                        {
                            if (0UL != (reset_cause_reg & PMC_AOREG1_PADRESET_MASK))
                            { /* Hardware Pin Reset */
                                *p_reset_cause = kRESET_CAUSE_PADRESET;
                            }
                            else
                            {
                                if (0UL != (reset_cause_reg & PMC_AOREG1_SWRRESET_MASK))
                                { /* Software triggered Reset */
                                    *p_reset_cause = kRESET_CAUSE_SWRRESET;
                                }
                                else
                                { /* Unknown Reset Cause */
                                    *p_reset_cause = kRESET_CAUSE_NOT_DETERMINISTIC;
                                }
                            }
                        }
                    }

#if (defined(LPC55S06_SERIES) || defined(LPC55S04_SERIES) || defined(LPC5506_SERIES) || defined(LPC5504_SERIES) || \
     defined(LPC5502_SERIES) || defined(LPC55S16_SERIES) || defined(LPC55S14_SERIES) || defined(LPC5516_SERIES) || \
     defined(LPC5514_SERIES) || defined(LPC5512_SERIES))
                    /* Transfer the control of the 4 wake-up pins to IOCON (instead of the Power Management Controller
                     */
                    PMC->WAKEUPIOCTRL = PMC->WAKEUPIOCTRL & (~PMC_WAKEUPIOCTRL_WAKEUPIO_ENABLE_CTRL_MASK);
#endif
                }
                else /* DEEP-SLEEP, POWER-DOWN and DEEP-POWER-DOWN */
                {
                    /*
                     * 1- First, save wakeup_io_cause register ...
                     */
                    *p_wakeupio_cause = PMC->WAKEIOCAUSE;

                    if (boot_mode_reg == 3UL) /* DEEP-POWER-DOWN */
                    {
                        *p_boot_mode = kBOOT_MODE_LP_DEEP_POWER_DOWN;

                        switch (((reset_cause_reg >> PMC_AOREG1_DPDRESET_WAKEUPIO_SHIFT) & 0x7UL))
                        {
                            case 1:
                                *p_reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO;
                                break;
                            case 2:
                                *p_reset_cause = kRESET_CAUSE_DPDRESET_RTC;
                                break;
                            case 3:
                                *p_reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO_RTC;
                                break;
                            case 4:
                                *p_reset_cause = kRESET_CAUSE_DPDRESET_OSTIMER;
                                break;
                            case 5:
                                *p_reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO_OSTIMER;
                                break;
                            case 6:
                                *p_reset_cause = kRESET_CAUSE_DPDRESET_RTC_OSTIMER;
                                break;
                            case 7:
                                *p_reset_cause = kRESET_CAUSE_DPDRESET_WAKEUPIO_RTC_OSTIMER;
                                break;
                            default:
                                /* Unknown Reset Cause */
                                *p_reset_cause = kRESET_CAUSE_NOT_DETERMINISTIC;
                                break;
                        }

#if (defined(LPC55S06_SERIES) || defined(LPC55S04_SERIES) || defined(LPC5506_SERIES) || defined(LPC5504_SERIES) || \
     defined(LPC5502_SERIES) || defined(LPC55S16_SERIES) || defined(LPC55S14_SERIES) || defined(LPC5516_SERIES) || \
     defined(LPC5514_SERIES) || defined(LPC5512_SERIES))
                        /*
                         * 2- Next, transfer the control of the 4 wake-up pins
                         * to IOCON (instead of the Power Management Controller)
                         */
                        PMC->WAKEUPIOCTRL = PMC->WAKEUPIOCTRL & (~PMC_WAKEUPIOCTRL_WAKEUPIO_ENABLE_CTRL_MASK);
#endif
                    }
                    else /* DEEP-SLEEP and POWER-DOWN */
                    {
                        *p_reset_cause = kRESET_CAUSE_NOT_RELEVANT;

                        /*
                         * The control of the 4 wake-up pins is already in IOCON,
                         * so there is nothing special to do.
                         */

                        if (boot_mode_reg == 1UL) /* DEEP-SLEEP */
                        {
                            *p_boot_mode = kBOOT_MODE_LP_DEEP_SLEEP;
                        }
                        else /* POWER-DOWN */
                        {
                            *p_boot_mode = kBOOT_MODE_LP_POWER_DOWN;

                        } /* if ( boot_mode_reg == 1 ) DEEP-SLEEP */

                    } /* if ( boot_mode == 3 )  DEEP-POWER-DOWN */

                } /* if ( boot_mode == 0 )  POWER-UP */

            } /* if ( reset_cause_reg & PMC_AOREG1_CDOGRESET_MASK ) */

        } /* if ( reset_cause_reg & PMC_AOREG1_WDTRESET_MASK ) */

    } /* if ( reset_cause_reg & PMC_AOREG1_SYSTEMRESET_MASK ) */
}
